configuration/src/Enums/КатегорииСообщенийПользователя/КатегорииСообщенийПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСообщенийПользователя</name>
  <enumValues>
    <name>АвтоматическоеЗакрытиеЗадач</name>
  </enumValues>
  <enumValues>
    <name>ВажныеИзмененияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеЗадачиВПул</name>
  </enumValues>
  <enumValues>
    <name>ДоступКОбъекту</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеДатВОбъекте</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЗнанийИВопросов</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеНаправленияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеОписанияИлиНазванияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПользователейВОбъекте</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОбъекта</name>
  </enumValues>
  <enumValues>
    <name>Комментарии</name>
  </enumValues>
  <enumValues>
    <name>ОповещениеОНаличииСтопСлов</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеИзмененияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>СозданиеОбъектов</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ЧастотаОповещенийПользователя/ЧастотаОповещенийПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЧастотаОповещенийПользователя</name>
  <enumValues>
    <name>Незамедлительно</name>
  </enumValues>
  <enumValues>
    <name>ДесятьМинут</name>
  </enumValues>
  <enumValues>
    <name>ТридцатьМинут</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/КатегорииСообщенийПользователя/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция КатегорииОповещенияПользователямПриИзмененииОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ИзменениеДатВОбъекте);
	Результат.Добавить(ИзменениеНаправленияОбъекта);
	Результат.Добавить(ИзменениеОписанияИлиНазванияОбъекта);
	Результат.Добавить(ИзменениеПользователейВОбъекте);
	Результат.Добавить(ИзменениеСтатусаОбъекта);
	Результат.Добавить(ПрочиеИзмененияОбъекта);
	
	Возврат Результат;
	
КонецФункции

Функция КатегорииОповещенияДляФормыНастройкиОповещений() Экспорт
	
	// При добавлении новых категорий заполнить колонки ЭлектроннаяПочта, ОповещениеВРабочийСтол, ПериодОтправки.
	// Эти настройки будут применяться для новых пользователей и при установке настроек по умолчанию в форме НастройкиПользователя
	ТаблицаКатегорий = Новый ТаблицаЗначений;
	ТаблицаКатегорий.Колонки.Добавить("КатегорияОповещения", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииСообщенийПользователя"));
	ТаблицаКатегорий.Колонки.Добавить("Наименование", ОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(100));
	ТаблицаКатегорий.Колонки.Добавить("Подсказка", ОбщегоНазначенияКлиентСервер.ОписаниеТипаСтрока(250));
	
	// Настройки по умолчанию
	ТаблицаКатегорий.Колонки.Добавить("СистемаВзаимодействия", Новый ОписаниеТипов("Булево"));
	ТаблицаКатегорий.Колонки.Добавить("ЭлектроннаяПочта", Новый ОписаниеТипов("Булево"));
	ТаблицаКатегорий.Колонки.Добавить("ОповещениеВРабочийСтол", Новый ОписаниеТипов("Булево"));
	ТаблицаКатегорий.Колонки.Добавить("ПериодОтправки", Новый ОписаниеТипов("ПеречислениеСсылка.ЧастотаОповещенийПользователя"));
	
	// Автоматическое закрытие задач
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = АвтоматическоеЗакрытиеЗадач;
	НоваяСтрока.Наименование = "Автоматическое закрытие задач, находящихся в тестировании более 10 рабочих дней";
	НоваяСтрока.ЭлектроннаяПочта = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.ДесятьМинут;
	
	// Доступ к объекту
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ДоступКОбъекту;
	НоваяСтрока.Наименование = "Предоставление доступа к объекту";
	НоваяСтрока.ЭлектроннаяПочта = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.ДесятьМинут;
	
	// Изменение дат в объекте
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ИзменениеДатВОбъекте;
	НоваяСтрока.Наименование = "Изменение дат из блока сроки в задачах и внутренних заданиях";
	НоваяСтрока.ЭлектроннаяПочта = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.Час;
	
	// Изменение направления
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ИзменениеНаправленияОбъекта;
	НоваяСтрока.Наименование = "Изменение направления разработки в задаче, заявке или внутреннем задании";
	НоваяСтрока.ЭлектроннаяПочта = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.Час;
	
	// Изменение опписания или названия
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ИзменениеОписанияИлиНазванияОбъекта;
	НоваяСтрока.Наименование = "Переименование или изменение описаний задач, заявок, внутренних заданий или проектов";
	НоваяСтрока.СистемаВзаимодействия = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.Час;

	// Изменение пользователей
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ИзменениеПользователейВОбъекте;
	НоваяСтрока.Наименование = "Изменение исполнителей, авторов, заказчиков, руководителей в объектах";
	НоваяСтрока.СистемаВзаимодействия = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.Час;
	
	// Изменение статуса
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ИзменениеСтатусаОбъекта;
	НоваяСтрока.Наименование = "Изменение статусов объектов";
	НоваяСтрока.СистемаВзаимодействия = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.Час;
	
	// Комментарии
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = Комментарии;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.ДесятьМинут;
	НоваяСтрока.Наименование = "Добавление комментариев к объектам";
	НоваяСтрока.СистемаВзаимодействия = Истина;
	
	// Создание объектов
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = СозданиеОбъектов;
	НоваяСтрока.Наименование = "Создание задач, заявок, внутренних заданий или проектов";
	НоваяСтрока.СистемаВзаимодействия = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.День;
	
	// Прочие изменения
	НоваяСтрока = ТаблицаКатегорий.Добавить();
	НоваяСтрока.КатегорияОповещения = ПрочиеИзмененияОбъекта;
	НоваяСтрока.Наименование = "Прочие изменения";
	НоваяСтрока.ЭлектроннаяПочта = Истина;
	НоваяСтрока.ПериодОтправки = Перечисления.ЧастотаОповещенийПользователя.День;

	ИнтеграцияДополнительныхПодсистем.ДополнитьНастройкиОповещений(ТаблицаКатегорий);
		
	Возврат ТаблицаКатегорий;
	
КонецФункции

Функция СамаяПриоритетнаяКатегория(Знач Категории) Экспорт
	
	МаксимальныйПриоритет = 0;
	ПриоритетнаяКатегория = Неопределено;
	
	Приоритеты = ПриоритетыКатегорий();
	
	Для Каждого Категория Из Категории Цикл
		ТекущийПриоритет = Приоритеты.Получить(Категория);
		Если ТекущийПриоритет > МаксимальныйПриоритет Тогда
			МаксимальныйПриоритет = ТекущийПриоритет;
			ПриоритетнаяКатегория = Категория;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПриоритетнаяКатегория;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПриоритетыКатегорий()
	
	Приоритеты = Новый Соответствие;
	
	Приоритеты.Вставить(Строка(ДоступКОбъекту), 0);
	Приоритеты.Вставить(Строка(АвтоматическоеЗакрытиеЗадач), 1);
	Приоритеты.Вставить(Строка(СозданиеОбъектов), 2);
	Приоритеты.Вставить(Строка(ПрочиеИзмененияОбъекта), 3);
	Приоритеты.Вставить(Строка(ИзменениеДатВОбъекте), 4);
	Приоритеты.Вставить(Строка(ИзменениеНаправленияОбъекта), 5);
	Приоритеты.Вставить(Строка(ОповещениеОНаличииСтопСлов), 6);
	Приоритеты.Вставить(Строка(ИзменениеОписанияИлиНазванияОбъекта), 7);
	Приоритеты.Вставить(Строка(ИзменениеПользователейВОбъекте), 8);
	Приоритеты.Вставить(Строка(ИзменениеСтатусаОбъекта), 9);
	Приоритеты.Вставить(Строка(Комментарии), 10);
	Приоритеты.Вставить(Строка(ВажныеИзмененияОбъекта), 11);
	
	Возврат Приоритеты;
	
КонецФункции

#КонецОбласти
